from typing import Final

MIN_LENGTH: Final[int] = 8
MAX_LENGTH: Final[int] = 50
PATTERN: Final[str] = (
    r"^(?=.*[a-z])"  # минимум 1 буква в нижнем регистре
    r"(?=.*[A-Z])"  # минимум 1 буква в верхнем регистре
    r"(?=.*\d)"  # минимум 1 цифра
    r'(?=.*[~!@#$%^&*_\-+=`|\\(){}[\]:;"\'<>,.?/])'  # минимум 1 спец символ
    r'[A-Za-z0-9~!@#$%^&*_\-+=`|\\(){}[\]:;"\'<>,.?/]*$'  # допустимые символы: латинский алфавит: A-Z a-z, цифры: 0-9, спец. символы: ~!@#$%^&*_-+=`|\(){}[]:;"'<>,.?/  # noqa E501
)
MAX_HISTORY_SIZE: Final[int] = 10
